Repository: eaxelson/hfst-import-test5
Catalog: branches/stable-2.0/hfst-tools/hfst-lexc/po/*.po
Languages: fi

source: [near: `%s\n']
fi: [lähellä kohtaa: %s\n]

source: [near: `%s']
fi: [lähellä kohtaa: %s]

source: [near: `%30s...' (truncated)]
fi: lähellä kohtaa: %30s... (katkaistu)]

source: Stray escape char %% in %s
fi: Orpo %%-merkki merkkijonossa %s

source: Usage: %s [OPTIONS] [INFILE...] Compile lexc files into an HFST transducer -h, --help Print this help message -V, --version Print version info -v, --verbose Print verbosely while compiling -q, --quiet Do not print verbosely while compiling -o, --output=OUTFILE Write output to OUTFILE -w, --weighted Use weighted transducer format -u, --unweighted Use unweighted transducer format -t, --time Time all stuff -d, --debug Print very verbosely -y, --hlexcdebug Enable Yacc's debug state -X, --xerox Imitate Xerox lexc messages If either INFILE... or OUTFILE is missing or -, standard streams will be used. If BOTH INFILE... and OUTFILE are missing, readline interface will be used. If output is stdout, -q is implied. If SYMFILE is missing, symbol table will be written with transducer binary, if possible. Examples: hfst-lexc -o file.hfst file.hlexc compiles single lexicon withdefault options hfst-lexc -w -v -o file.hwfst file1.hlexc file2.hlexc compile weighted lexicons from multiple sources Report bugs to HFST team <hfst-bugs@helsinki.fi>
fi: Käyttö: %s [ASETUKSET] [TIEDOSTOT...] Kääntää lexc-tiedostoista HFST-transduktorin -h, --help Näytä tämä ohje -V, --version Näytä versiotiedot -v, --verbose Tulosta monisanaisesti käännöksestä -q, --quiet Älä tulosta mitään käännettäessä -o, --output=TIEDOSTO Tallenna tulos TIEDOSTOon -w, --weighted Tee painollinen transduktori -u, --unweighted Tee painottamaton transduktori -t, --time Ajasta juttuja -d, --debug Tulosta erittäin monisanaisesti -y, --hlexcdebug Kytke yaccin vianetsintätila päälle -X, --xerox Matki Xeroxin lexc:n tulosteita Jos TIEDOSTOT... tai TIEDOSTO puuttuu tai on -, vakiovirtoja käytetään. Jos molemmat TIEDOSTOT... ja TIEDOSTO puuttuvat, readline-käyttöliittymä avataan. Esimerkkejä: hfst-lexc käynnistä vuorovaikutteinen käyttöliitymä hfst-lexc -o file.hfst file.hlexc käännä yksi leksikko oletusasetuksilla hfst-lexc -w -v -o file.hwfst file1.hlexc file2.hlexc käännä painollisia leksikoita monesta tiedostosta Ilmoita vioista osoitteeseen <hfst-bugs@helsinki.fi>

source: %s copyright (C) 2009 University of Helsinki, License GPLv3: GNU GPL version 3 <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
fi: %s copyright (C) 2009 Helsingin yliopisto, Lisenssi GPLv3: GNU GPL versio 3 <http://gnu.org/licenses/gpl.html> Tämä on vapaata lähdekoodia: voit muuttaa ja jaella sovellusta. Tästä ei ole takuita lain suomissa rajoissa.

source: Try ``%s --help'' for more information.
fi: Komennolla %s --help saa lisätietoja.

source: Input/Output ------------------------------------------------------------------ Source: compile-source, merge-source, read-source, result-to-source, save-source. Rules: read-rules. Result: merge-result, read-result, save-result, source-to-result. Properties: add-props, reset-props, save-props. Operations -------------------------------------------------------------------- Composition: compose-result, extract-surface-forms, invert-source, invert-result. Checking: check-all, lookdown, lookup, random, random-lex, random-surf. Switches: ambiguities, duplicates, failures, obey-flags, print-space, recode-cp1252, quit-on-fail, show-flags, singles, time, utf8-mode. Scripts: begin-script, end-script, run-script. Display ----------------------------------------------------------------------- Misc: banner, labels, props, status, storage. Help: completion, help, history, ?. Type 'quit' to exit.
fi: Luku ja tulostus ------------------------------------------------------------------ Source: compile-source, merge-source, read-source, result-to-source, save-source. Rules: read-rules. Result: merge-result, read-result, save-result, source-to-result. Properties: add-props, reset-props, save-props. Operaatiot -------------------------------------------------------------------- Composition: compose-result, extract-surface-forms, invert-source, invert-result. Checking: check-all, lookdown, lookup, random, random-lex, random-surf. Switches: ambiguities, duplicates, failures, obey-flags, print-space, recode-cp1252, quit-on-fail, show-flags, singles, time, utf8-mode. Scripts: begin-script, end-script, run-script. Näyttö ----------------------------------------------------------------------- Misc: banner, labels, props, status, storage. Help: completion, help, history, ?. Kirjoita 'quit' lopettaaksesi.

source: Input/Output ------------------------------------------------------------------ Source: compile-source, save-source. Operations -------------------------------------------------------------------- Switches: debug, verbose, time, weighted. Display ----------------------------------------------------------------------- Misc: banner. Help: completion, help, history, ?. Type 'quit' to exit.
fi: Luku ja tulostus ------------------------------------------------------------------ Leksikko: compile-source, save-source. Operaatiot -------------------------------------------------------------------- Vipuset: debug, verbose, time, weighted. Näyttö ----------------------------------------------------------------------- Muut: banner. Ohje: completion, help, history, ?. Komennolla 'quit' lopetetaan.

source: THIS version of hfst-lexc does NOT support MOST of the lexc commands In the meantime: * Handling of RULES (and RESULT) can be done with hfst-twolc * Inspecting can be done with hfst-summarize, hfst-fst2txt, ... * For legacy character set support, use iconv or recode
fi: Tämä hfst-lexc ei tue enimpiä lexc:n komentoja Kunnes niitä toteutetaan: * Kaksitasosäännöt (ja tulokset) tehdään hfst-twolc:llä * Tuloksia tutkitaan työkaluilla hfst-summarize, hfst-fst2txt, jne. * Vanhoja merkkikoodauksia voi kääntää iconvilla tai recodella

source: ******************************************************* * HFST Finite-State Lexicon Compiler %10s * * compatible(?) with Xerox lexc 3.7.9 * * created by * * Tommi Pirinen and the HFST team * * Copyright (c) 2008-2009 by University of Helsinki * * All Rights Reversed. * *******************************************************
fi: ******************************************************* * HFST:n äärellistilainen leksikkokäännin %10s * * yhteensopiva(?) Xerox lexc 3.7.9:ään * * tekijät * * Tommi Pirinen ja HFST-tiimi * * Copyright (c) 2008–2009 by University of Helsinki * * All Rights Reversed. * *******************************************************

source: 'compile-source <textfile>' reads the lexc source file contained in <textfile>, compiles it, and stores the resulting network in the SOURCE register. You can save this network to file with the command 'save-source'. To read a pre-compiled network from file into the SOURCE register, use the command 'read-source'. To compose the SOURCE network with a set of rule transducers, previously read in by 'read-rules', use the command 'compose-result'.
fi: 'compile-source <tiedosto>' lukee <tiedostosta> lexc-kuvauksen kääntää sen, ja tallentaa tuloksen SOURCE-rekisteriin. Tämän voi kirjoittaa tiedostoon komennolla 'save-source'. To read a pre-compiled network from file into the SOURCE register, use the command 'read-source'. To compose the SOURCE network with a set of rule transducers, previously read in by 'read-rules', use the command 'compose-result'.

source: '?' displays a menu of available lexc commands.
fi: '?' näyttää valikon lexc-komennoista.

source: 'banner' displays information about the version and the authors of the Helsinki Finite-State Lexicon Compiler.
fi: 'banner' näyttää HFST:n äärellistilaisen leksikkokääntimen versiotietoja ja tekijät.

source: 'help <command>' displays short documentation on what <command> does. 'help all' prints out all help messages. '?' displays a menu of available lexc commands.
fi: 'help <komento>' näyttää ohjeen siitä mitä <komento> tekee. 'help all' näyttää kaikki ohjeet. '?' näyttää listan komennoista.

source: 'history' displays the history list.
fi: 'history' näyttää luettelon käytetyistä komennoista.

source: 'quit' exits lexc.
fi: 'quit' lopettaa lexc:n.

source: 'save-source <filename>' stores the current SOURCE network to file in a binary format. Use 'read-source' or 'read-result' to read in files created in this way.
fi: 'save-source <tiedosto>' tallentaa SOURCE-transduktorin tiedostoon Komennoilla 'read-source' tai 'read-result' luetaan näitä tiedostoja.

source: 'time' is an ON/OFF or toggled switch that provides timing information for some commands. The default setting is OFF.
fi: 'time' on binääriasetus joka säätää joidenkin komentojen ajastusta. Oletus on pois päältä.

source: printing verbosely
fi: tulostetaan monisanaisesti

source: debug enabled
fi: vianetsintätila on päällä

source: timing enabled
fi: ajastus on päällä

source: building weighted transducer
fi: rakennetaan painollinen transduktori

source: building unweighted transducer
fi: rakennetaan painoton transduktori

source: Reading from <stdin>
fi: Luetaan tiedosto <vakiosyötteestä>

source: <stdin>
fi: <vakiosyöte>

source: reading from %s
fi: luetaan tiedostosta %s

source: There were parsing errors, aborting.
fi: Lopetetaan jäsennysvirheiden takia.

source: Compiling...
fi: Lasketaan...

source: Saving result to standard output
fi: Tallennetaan tulos vakiotulosteeseen

source: Saving result to %s
fi: Tallennetaan tulos tiedostoon %s

source: Starting in utf8-mode (in fact, only supporting UTF-8)
fi: Aloitetaan utf8-mode päällä (muita ei oikeastaan tueta)

source: History is empty.
fi: Historia on tyhjä.

source: This platform does not support history_list
fi: Tällä alustalla history_list ei toimi

source: Timing is OFF.
fi: Ajastus on pois päältä.

source: Timing is ON.
fi: Ajastus on päällä.

source: Verbosity is OFF.
fi: Tulostus ei ole monisanaista.

source: Verbosity is ON.
fi: Tulostus on monisanaista.

source: Debugging is OFF.
fi: Vianetsintä on pois päältä.

source: Debugging is ON.
fi: Vianetsintä on päällä.

source: Changing weightedness after compilation will cause unstability!
fi: Painollisuuden muuttaminen kääntämisen jälkeen ei välttämättä toimi!

source: Weights are OFF.
fi: Painollisuus on pois päältä.

source: Weights are ON.
fi: Painollisuus on päällä.

source: input file [stdin]:
fi: luettava tiedosto [vakiosyöte]:

source: Type a standard lexicon file. File ends with '<CR>^D'...
fi: Anna standardi leksikkotiedosto. Lopeta syöte <CR>^D:llä...

source: opening "%s"
fi: avataan %s

source: Opening '%s'...
fi: Avataan %s...

source: Output file [cancel]:
fi: Tulostetiedosto [peru]:

source: Cancelled.
fi: Peruttu.

source: Done.
fi: Valmis.

source: '%s' is not an operation. Type '?' for a list.
fi: %s ei ole komento. ? luetteloi komennot.

source: Whole process
fi: Koko suoritus

source: * String parsing
fi: * Merkkijonojen jäsennys

source: * String trie building
fi: * Merkkijonotrien rakennus

source: * Regular expression compiling
fi: * Säännöllisten ilmausten kääntö

source: * Regular expression joining
fi: * Säännöllisten ilmausten yhdistely

source: * Completing sigma set
fi: * Sigman täydennys

source: * Applying morphotax
fi: * Morfotaksin toteutus

source: * All the minimising
fi: * Minimoinnit

source: Undeclared character %s in %s
fi: Tuntematon merkki %s jonossa %s

source: All strings containing %s are dropped
fi: Kaikki merkkijonot joissa on %s poistetaan

source: Found Xymbol %s from %s
fi: Xymboli %s merkkijonossa %s

source: Undeclared character %s in %s All strings containing %s dropped
fi: Tuntematon merkki %s jonossa %s Kaikki merkkijonot joissa on %s poistetaan

source: Building lexicon...
fi: Käännetään leksikkoa...

source: Strings trie
fi: Merkkijonotrie

source: RegExps
fi: Säännölliset ilmaukset

source: Strings or RegExps
fi: Merkkijonot tai säännölliset ilmaukset

source: Minimizing...
fi: Minimoidaan...

source: Morphotaxed
fi: Morfotaksin jälkeen

source: Done!
fi: Valmis.

source: could not open %s for writing: %s
fi: ei voitu avata tiedostoa %s kirjoittamista varten: %s

source: could not open %s for reading: %s
fi: ei voitu avata tiedostoa %s lukemista varten: %s

source: could not open %s: %s
fi: ei voitu avata tiedostoa %s: %s

source: Illegal 8-bit sequence (cannot form valid UTF-8)
fi: Viallinen 8 bitin sarja (ei voi muodostaa UTF-8-merkkijonoa)

source: Syntax error in lexer (no valid token found at the point)
fi: Jäsennysvirhe leksikaalisessa analyysissä (ei voida luoda merkkiä tästä)

source: ALPHABET: %s
fi: AAKKONEN: %s

source: MULTICHAR_SYMBOL: %s
fi: MONIMERKKISYMBOLI: %s

source: Defined '%s': ? Kb., ? states, ? arcs, ? paths.
fi: Määritelty %s: ? Kb, ? tilaa, ? kaarta, ? polkua.

source: LEXICON: %s
fi: Leksikko: %s

source: first lexicon is not named Root
fi: Ensimmäinen leksikko ei ole nimeltään Root

source: Using %s as initial lexicon
fi: Käytetään leksikkoa %s ensimmäisenä

source: LEXICON Root is not first
fi: LEXICON Root ei ole ensimmäinen määritelty

source: Using Root as initial lexicon again
fi: Palautetaan leksikko Root ensimmäiseksi

source: Lexicon %s...
fi: Leksikko %s...

source: Entries so far: %10d; in this lexicon: %10d
fi: Entryjä tähän mennessä: %10d; tässä leksikossa %10d

source: Ignoring info strings
fi: Ohitetaan infostringit

source: weight %f
fi: paino %f

source: Building unweighted transducer from weighted lexicon
fi: Rakennetaan painottamatonta transduktoria painollisesta leksikosta

source: Explicit END called, skipping rest
fi: END huudettu, ohitetaan loput

source: Reading alphabet
fi: Luetaan aakkostoa

source: Reading multicharacter symbols
fi: Luetaan monimerkkisymboleja

source: Reading definitions
fi: Luetaan määrittelyt
